{"hed":"Sing My Name","sub":"Musical Data Exploration","dek":"If your name is Baby, then seemingly every song is about you. But what if your name isn’t Baby?","byline":"Amber Thomas","bylineLink":"https://pudding.cool/author/amber-thomas","pubDate":"May 2019","sectionTitle":"Story Sections","nonPeopleTitle":"Name Filtering","nonPeopleText":[{"type":"text","value":"Many people’s names can also be places, brands, vehicles, drugs and other things that may not be related to an actual person."}],"buttonQuery":"Include mentions of non-people?","sections":[{"title":"What Is This?","desc":"A brief intro into this data-driven look at names in songs","link":"intro"},{"title":"Popular Names","desc":"Find how your name stacks up","link":"popular"},{"title":"Repeat Names","desc":"The songs that mention the same name over and over again","link":"repeat"},{"title":"Unique Names","desc":"The songs and artists that just name drop everyone","link":"unique"},{"title":"Timeless Names","desc":"Watching the most popular names in songs change over 70 years","link":"timeless"},{"title":"First & Last Letters","desc":"The letters that start and end names in songs more often than in society","link":"letters"},{"title":"Methods","desc":"Where all these numbers came from","link":"methods"}],"introPre":"Let me set the scene for you. You’re having a lovely conversation with a perfect stranger when they say <strong>“What’s your name?”</strong> You respond by saying:","introPost":[{"type":"text","value":"The film <em>Baby Driver</em> may be about bank heists, but the musical score carries both the action and the movie’s entire plot. According to the director, the scenes were loosely <a href=https://variety.com/2017/film/news/baby-driver-movie-music-1202482594/ target=_blank>built</a> <a href=https://www.digitaltrends.com/movies/baby-driver-music-sound-effects/ target_blank>around the soundtrack</a>, instead of the other way around."},{"type":"text","value":"Flirty banter about songs even leads to the main character’s <a href=https://www.youtube.com/watch?v=6O554p-ovsI target=_blank>“meet-cute” moment</a>. In the scene, Debora was lamenting the fact that her name was never used in songs, unlike her sister, Mary. Little did she know, she was complaining to someone named Baby. Upon learning his name, she laughed and said that he had both her and Mary beat, since every song is about Baby. She’s not wrong. Here are just 5 examples."}],"introPlaylist":[{"lyrics":"“<span>Baby</span>, baby, where did our love go?”","title":"Where Did Our Love Go","artist":"The Supremes","year":"1964","file":"where_did_our_love_go"},{"lyrics":"“<span>Baby</span>, just remember I gave you my heart”","title":"Forever Your Girl","artist":"Paula Abdul","year":"1989","file":"forever_your_girl"},{"lyrics":"“<span>Baby</span>, I’m not always there when you call”","title":"Always on Time","artist":"Ja Rule ft. Ashanti","year":"2001","file":"always_on_time"},{"lyrics":"“<span>Baby</span>, how you do that, make a grown man cry?”","title":"OMG","artist":"Usher ft will.i.am","year":"2010","file":"omg"},{"lyrics":"“<span>Baby</span>, I’m the one who put you up there.”","title":"Without Me","artist":"Halsey","year":"2018","file":"without_me"}],"postPlaylist":[{"type":"text","value":"There are hundreds more songs just like those played above. In an analysis of over 15,000 hit songs in the US, 1,832 of them referenced someone referred to as Baby. The next closest name, Jesus, was found in only 142 songs."},{"type":"text","value":"Of course, it’s worth noting that in many song-writing contexts, it is less likely that artists are singing to someone <em>literally</em> named Baby, and are more than likely using it as a pet name or term of endearment. But, Baby is a <a href=https://www.ssa.gov/cgi-bin/babyname.cgi target=_blank>real name</a>. Practically speaking, there’s no way to separate out references to someone <em>named</em> Baby from someone simply being <em>called</em> Baby."},{"type":"text","value":"Semantics aside, Debora’s point is an interesting one. Which names do artists sing about? There are many ways to answer this question and I decided to explore as many as I could. The sections of this story are self-contained and can be read in any order, so feel free to use the navigation on the left-hand side to jump around."}],"disclaimer":"How were these numbers calculated?","disclaimerBody":"This analysis includes over 15,000 songs that made it onto the Billboard Hot 100 at least once between its inception in the 1950’s and April 2019. Top songs for which we could not find the lyrics are not included in this analysis. Words were considered “names” if they met the following criteria: the word had been used as a name in the US at least 5,000 times since 1950 (according to the Social Security Administration) and the word is used as a proper noun in the sentence. A total of 5,316 of the analyzed songs contained at least one instance of a name. More details in the <a href=#methods>Methods</a> section of this article.","playlistButton":"Go to the Playlist","popularTitle":"Popular Names","popularDek":"Where does your name stack up?","popularSongs":"50 songs","popularTime":"10 hours, 35 min","popularProse":"Alright, so we already know that “Baby” is the most popular name by far, but check out the other most popular names. Apart from Jesus, these names have a long history of popularity in the US. While many of these names hit their peak popularity in the 1950’s, many are still popular today, with Michael and John still ranking as the 8th and 26th and most common boy’s names in the US in 2016, respectively.","popularSearch":"Interested in finding what songs include a mention of your name? Enter it into the search field below.","popularSparkTitle":"Most Common Names*","popularSparkSub":"By count of songs","popularSparkNote":"*Excluding “Baby” with 1,832 songs","repeatTitle":"Repeat Names","repeatDek":"The songs that mention the same name over and over again","repeatSongs":"53 songs","repeatTime":"3 hr 20 min","repeatPlaylist":"https://open.spotify.com/user/amberthomasmsc/playlist/7KFcZ2gn3z2MbUEnjtMehd?si=z-R7oZuUTHS6p3hirQY7fA","repeatProse":"You know how some songs are just absolute ear-worms and they get stuck in your head for days? Well, some of the songs in this section make me wonder if names can be ear-worms too. If your name is Mickey, Scotty, Bennie, or (if you’re willing to ignore that this is actually a drug-reference) Molly, you’re probably already intimately familiar with these tunes. Check out the most name-repetitive hits or search for your favorites below.","repeatChartTitle":"Songs with the Most Instances of the Same Name","repeatChartSub":"Count of name mentions in a single song","uniqueTitle":"Unique Names","uniqueDek":"The songs that name drop everyone","uniqueSongs":"18 songs","uniqueTime":"1 hr 23 min","uniquePlaylist":"https://open.spotify.com/user/amberthomasmsc/playlist/4evpknRWwyuW07td0ZojuV?si=P0yrdddGSSaSFKgTVDVnBg","uniqueProse":"Growing up, <a href=https://www.youtube.com/watch?v=EK_LN3XEcnw target=_blank><em>Mambo No. 5</em></a> was always a fun song to hear at parties, because so many of my friends were named in succession. Generally, it was a fun song to serenade them with. Though, with only 9 distinct names repeated several times, Lou Bega’s viral hit didn’t even crack the top 10 songs with the most number of names. The number one spot for that distinct honor goes to Billy Joel’s <a href=https://www.youtube.com/watch?v=eFTLKWw542g target=_blank><em>We Didn’t Start the Fire</em></a>.","uniqueChartTitle":"Songs that Contain the Most Unique Names","uniqueChartSub":"By count of names mentioned at least once","uniqueArtistTitle":"Artists that Use the Most Unique Names","uniqueArtistSub":"By count of names that appear in a collection of songs at least once","uniqueArtistProse":"Some artists end up using lots of names in their songs, but spread them out across many hits. When we look at the artists that have used the most names in their songs, there are a few things worth noting. The top 5 name-dropping artists are all hip-hop or rap musicians and the top 3 (Drake, Eminem, and Lil Wayne) use their own name in more songs than any other name in their repertoire. And, to be fair, since Kanye’s and Future’s (stage and legal) names are not used very frequently in the US (according to the Social Security Administration), they were <a href=#methods>excluded</a> from the names we searched for.","timelessTitle":"Timeless Names","timelessDek":"How the most popular names in songs have changed since the 70s","timelessSongs":"50 songs","timelessTime":"10 hours, 35 min","timelessProse":"To the surprise of (probably) no one, “Baby” has been holding down the spot of most common name to sing about for the past 5 decades. There are also a few other interesting trends to point out here. Only a handful of the most popular names over time have been typically women’s names. This is certainly counter to my gut-feeling that names are sung primarily by (presumably straight) men in love songs. We also see the rise in naming either oneself or other reputable artists becoming more common in the 2010’s with mentions of Wayne, Drake, and Nicki breaking into the top 10.","timelessChartTitle":"Top 10 Most Common Names Per Decade","timelessChartSub":"By count of songs that mention a name at least once","lettersTitle":"Lettering","lettersDek":"Are artists primarily interested in names that start or end a certain way?","lettersSongs":"50 songs","lettersTime":"10 hours, 35 min","lettersProse":[{"type":"text","value":"Back in 2014, <em>Slate</em> published an <a href=https://slate.com/culture/2014/07/most-common-names-in-songs-why-is-pop-music-obsessed-with-songs-about-johnny-jenny-and-jane.html target=_blank>article</a> about how the first names used in popular song titles disproportionately started with J. They went on to mention that compared to the actual population of the US, names that started with M, A, and J were more popular in songs than they were in society. Does that trend hold true when we look past song titles and into their lyrics? Short version: not so much. Names that start with A are much more common in society than in song lyrics, while names that start with J show up with similar frequency in both situations."},{"type":"text","value":"Looking at the opposite end of the word, names that <em>end</em> with A (e.g., Maria, Rhonda, Sara, Lisa etc.) are much less common in songs than society, whereas names that end with Y (e.g., Mary, Johnny, Jimmy, Billy etc.) are much more common in songs. This could be attributed to the fact that names in songs are used casually and thus tend to be nicknames."}],"lettersNote":"Calculated as the difference between the percentage of names mentioned in at least one song that starts or ends with a letter and the percentage of names that have been used as names in the US at least 5,000 times since 1950 that start or end with that letter.","methods":[{"type":"text","value":"All songs used in this analysis were on the <a href=https://www.billboard.com/charts/hot-100 target=_blank>US Billboard Hot 100 list</a> at least once since the chart’s inception in 1958. Song lyrics were obtained primarily through <a href=http://www.metrolyrics.com/ target=_blank>MetroLyrics</a>. Many thanks to <a href=http://colinmorris.github.io/ target=_blank>Colin Morris</a> for providing lyric data for songs popular prior to 2017 (used in his project on <a href=https://pudding.cool/2017/05/song-repetition target=_blank>repetition in pop music</a>). Since these lyrics are user submitted, it is possibly (and even likely) that there are spelling errors that I was unable to compensate for. Over 15,000 songs that met the above criteria were analyzed, and of those, 5,195 contained a name (as defined below)."},{"type":"text","value":"To identify names in song lyrics, I used US national-level baby name data from the Social Security Administration (<a href=https://www.kaggle.com/kaggle/us-baby-names target=_blank>downloaded from Kaggle</a>). Since there were over 93,000 names in this dataset, I limited my search to just those names that have been used as names at least 5,000 times since the 1950’s. This resulted in 3,607 names. I then searched through the song lyrics for any instance of any name in this dataset. Using the R <a href=https://cran.r-project.org/web/packages/udpipe/index.html target=_blank>package</a> <code>udpipe</code>, I tagged each name with a part of speech to eliminate uses of words that were used as verbs (e.g., Will the person vs. “I will do something”) or adjectives (e.g., “baby girl”). I intended to retain only names tagged as proper nouns, but since song lyrics are not always grammatically correct, part of speech tagging can be inaccurate. Thus, I also manually checked the data, removing instances of names that were not being used as proper nouns."},{"type":"text","value":"There were a few other manual corrections made. Last names presented as surnames (e.g., “Kennedy” in “John F. Kennedy”) were removed, but if the surname stood on its own (e.g. “I am the realest since Kennedy”) it could have been referring to a first name, so it was retained. Names that appeared to refer to a non-person (e.g., places, brands, drug references, colors, seasons, etc.) have been removed from the default view, but can be included in the analysis using the “Include Non-People” toggle in the left-pane. Double word names (e.g., Barbara Ann) were adjusted manually to count as a single entity rather than counting as “Barbara” and “Ann”."}]}